/*************************************************************************
 This file is generated by scripts , please don't change this file directly
*************************************************************************/

#ifndef __SYS_CON3_H__
#define __SYS_CON3_H__

typedef union PAD_SHARE_0_U_
{
	 unsigned long v;
	 struct PAD_SHARE_0_T_
	 {
		 unsigned pad_gpio12_func_sel                           : 4;
		 unsigned pad_gpio13_func_sel                           : 4;
		 unsigned pad_gpio14_func_sel                           : 4;
		 unsigned pad_gpio15_func_sel                           : 4;
		 unsigned pad_gpio16_func_sel                           : 4;
		 unsigned pad_gpio17_func_sel                           : 4;
		 unsigned pad_gpio18_func_sel                           : 4;
		 unsigned pad_gpio19_func_sel                           : 4;
	 }bit_info;
}PAD_SHARE_0_U;

typedef union PAD_SHARE_1_U_
{
	 unsigned long v;
	 struct PAD_SHARE_1_T_
	 {
		 unsigned pad_gpio20_func_sel                           : 4;
		 unsigned pad_gpio21_func_sel                           : 4;
		 unsigned pad_gpio22_func_sel                           : 4;
		 unsigned pad_gpio23_func_sel                           : 4;
		 unsigned pad_gpio24_func_sel                           : 4;
		 unsigned pad_gpio25_func_sel                           : 4;
		 unsigned pad_gpio26_func_sel                           : 4;
		 unsigned pad_gpio27_func_sel                           : 4;
	 }bit_info;
}PAD_SHARE_1_U;

typedef union PAD_SHARE_2_U_
{
	 unsigned long v;
	 struct PAD_SHARE_2_T_
	 {
		 unsigned pad_gpio28_func_sel                           : 4;
		 unsigned pad_gpio29_func_sel                           : 4;
		 unsigned pad_gpio30_func_sel                           : 4;
		 unsigned pad_gpio31_func_sel                           : 4;
		 unsigned pad_gpio32_func_sel                           : 4;
		 unsigned pad_gpio33_func_sel                           : 4;
		 unsigned pad_gpio34_func_sel                           : 4;
		 unsigned pad_gpio35_func_sel                           : 4;
	 }bit_info;
}PAD_SHARE_2_U;

typedef union PAD_SHARE_3_U_
{
	 unsigned long v;
	 struct PAD_SHARE_3_T_
	 {
		 unsigned pad_gpio36_func_sel                           : 4;
		 unsigned pad_gpio37_func_sel                           : 4;
		 unsigned pad_gpio38_func_sel                           : 4;
		 unsigned pad_gpio39_func_sel                           : 4;
		 unsigned pad_gpio40_func_sel                           : 4;
		 unsigned pad_gpio41_func_sel                           : 4;
		 unsigned pad_gpio42_func_sel                           : 4;
		 unsigned pad_gpio43_func_sel                           : 4;
	 }bit_info;
}PAD_SHARE_3_U;

typedef union PAD_SHARE_4_U_
{
	 unsigned long v;
	 struct PAD_SHARE_4_T_
	 {
		 unsigned pad_gpio12_pe                                 : 1;
		 unsigned pad_gpio13_pe                                 : 1;
		 unsigned pad_gpio14_pe                                 : 1;
		 unsigned pad_gpio15_pe                                 : 1;
		 unsigned pad_gpio16_pe                                 : 1;
		 unsigned pad_gpio17_pe                                 : 1;
		 unsigned pad_gpio18_pe                                 : 1;
		 unsigned pad_gpio19_pe                                 : 1;
		 unsigned pad_gpio20_pe                                 : 1;
		 unsigned pad_gpio21_pe                                 : 1;
		 unsigned pad_gpio22_pe                                 : 1;
		 unsigned pad_gpio23_pe                                 : 1;
		 unsigned pad_gpio24_pe                                 : 1;
		 unsigned pad_gpio25_pe                                 : 1;
		 unsigned pad_gpio26_pe                                 : 1;
		 unsigned pad_gpio27_pe                                 : 1;
		 unsigned pad_gpio28_pe                                 : 1;
		 unsigned pad_gpio29_pe                                 : 1;
		 unsigned pad_gpio30_pe                                 : 1;
		 unsigned pad_gpio31_pe                                 : 1;
		 unsigned pad_gpio32_pe                                 : 1;
		 unsigned pad_gpio33_pe                                 : 1;
		 unsigned pad_gpio34_pe                                 : 1;
		 unsigned pad_gpio35_pe                                 : 1;
		 unsigned pad_gpio36_pe                                 : 1;
		 unsigned pad_gpio37_pe                                 : 1;
		 unsigned pad_gpio38_pe                                 : 1;
		 unsigned pad_gpio39_pe                                 : 1;
		 unsigned pad_gpio40_pe                                 : 1;
		 unsigned pad_gpio41_pe                                 : 1;
		 unsigned pad_gpio42_pe                                 : 1;
		 unsigned pad_gpio43_pe                                 : 1;
	 }bit_info;
}PAD_SHARE_4_U;

typedef union PAD_SHARE_5_U_
{
	 unsigned long v;
	 struct PAD_SHARE_5_T_
	 {
		 unsigned pad_gpio12_ds                                 : 1;
		 unsigned pad_gpio13_ds                                 : 1;
		 unsigned pad_gpio14_ds                                 : 1;
		 unsigned pad_gpio15_ds                                 : 1;
		 unsigned pad_gpio16_ds                                 : 1;
		 unsigned pad_gpio17_ds                                 : 1;
		 unsigned pad_gpio18_ds                                 : 1;
		 unsigned pad_gpio19_ds                                 : 1;
		 unsigned pad_gpio20_ds                                 : 1;
		 unsigned pad_gpio21_ds                                 : 1;
		 unsigned pad_gpio22_ds                                 : 1;
		 unsigned pad_gpio23_ds                                 : 1;
		 unsigned pad_gpio24_ds                                 : 1;
		 unsigned pad_gpio25_ds                                 : 1;
		 unsigned pad_gpio26_ds                                 : 1;
		 unsigned pad_gpio27_ds                                 : 1;
		 unsigned pad_gpio28_ds                                 : 1;
		 unsigned pad_gpio29_ds                                 : 1;
		 unsigned pad_gpio30_ds                                 : 1;
		 unsigned pad_gpio31_ds                                 : 1;
		 unsigned pad_gpio32_ds                                 : 1;
		 unsigned pad_gpio33_ds                                 : 1;
		 unsigned pad_gpio34_ds                                 : 1;
		 unsigned pad_gpio35_ds                                 : 1;
		 unsigned pad_gpio36_ds                                 : 1;
		 unsigned pad_gpio37_ds                                 : 1;
		 unsigned pad_gpio38_ds                                 : 1;
		 unsigned pad_gpio39_ds                                 : 1;
		 unsigned pad_gpio40_ds                                 : 1;
		 unsigned pad_gpio41_ds                                 : 1;
		 unsigned pad_gpio42_ds                                 : 1;
		 unsigned pad_gpio43_ds                                 : 1;
	 }bit_info;
}PAD_SHARE_5_U;

typedef union I2C_OUTPUT_CTL_U_
{
	 unsigned long v;
	 struct I2C_OUTPUT_CTL_T_
	 {
		 unsigned i2c_output_ctl                                : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}I2C_OUTPUT_CTL_U;

typedef union SEL_EXT_USB2_CTRL_U_
{
	 unsigned long v;
	 struct SEL_EXT_USB2_CTRL_T_
	 {
		 unsigned sel_ext_usb2_ctrl                             : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}SEL_EXT_USB2_CTRL_U;

typedef union SEL_USB2_UTMI_CLK_U_
{
	 unsigned long v;
	 struct SEL_USB2_UTMI_CLK_T_
	 {
		 unsigned sel_usb2_utmi_clk                             : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}SEL_USB2_UTMI_CLK_U;

typedef union IMG_WIDTH_REG_U_
{
	 unsigned long v;
	 struct IMG_WIDTH_REG_T_
	 {
		 unsigned img_width_reg                                 : 16;
		 unsigned reserved0                                     : 16;
	 }bit_info;
}IMG_WIDTH_REG_U;

typedef union IMG_HEIGHT_REG_U_
{
	 unsigned long v;
	 struct IMG_HEIGHT_REG_T_
	 {
		 unsigned img_height_reg                                : 16;
		 unsigned reserved0                                     : 16;
	 }bit_info;
}IMG_HEIGHT_REG_U;

typedef union IRSTATTHRESHOLD_REG_U_
{
	 unsigned long v;
	 struct IRSTATTHRESHOLD_REG_T_
	 {
		 unsigned irstatthreshold_reg                           : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}IRSTATTHRESHOLD_REG_U;

typedef union BYPASS_IR_STATS_U_
{
	 unsigned long v;
	 struct BYPASS_IR_STATS_T_
	 {
		 unsigned bypass_ir_stats                               : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}BYPASS_IR_STATS_U;

typedef union FROZEN_HW_UPDATE_COM_U_
{
	 unsigned long v;
	 struct FROZEN_HW_UPDATE_COM_T_
	 {
		 unsigned frozen_hw_update_com                          : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}FROZEN_HW_UPDATE_COM_U;

typedef union IR_STATS_ENABLE_U_
{
	 unsigned long v;
	 struct IR_STATS_ENABLE_T_
	 {
		 unsigned ir_stats_enable                               : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}IR_STATS_ENABLE_U;

typedef union ENA_CLR_ODD_COUNT_U_
{
	 unsigned long v;
	 struct ENA_CLR_ODD_COUNT_T_
	 {
		 unsigned ena_clr_odd_count                             : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}ENA_CLR_ODD_COUNT_U;

typedef union ENA_CLR_EVEN_COUNT_U_
{
	 unsigned long v;
	 struct ENA_CLR_EVEN_COUNT_T_
	 {
		 unsigned ena_clr_even_count                            : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}ENA_CLR_EVEN_COUNT_U;

typedef union FORCE_COMP_PIX_U_
{
	 unsigned long v;
	 struct FORCE_COMP_PIX_T_
	 {
		 unsigned force_comp_pix                                : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}FORCE_COMP_PIX_U;

typedef union SOFTCOMP_0_REG_U_
{
	 unsigned long v;
	 struct SOFT_COMP_0_REG_T_
	 {
		 unsigned soft_comp_0_reg                               : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}SOFT_COMP_0_REG_U;

typedef union SOFT_COMP_1_REG_U_
{
	 unsigned long v;
	 struct SOFT_COMP_1_REG_T_
	 {
		 unsigned soft_comp_1_reg                               : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}SOFT_COMP_1_REG_U;

typedef union SOFT_COMP_2_REG_U_
{
	 unsigned long v;
	 struct SOFT_COMP_2_REG_T_
	 {
		 unsigned soft_comp_2_reg                               : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}SOFT_COMP_2_REG_U;

typedef union SOFT_COMP_3_REG_U_
{
	 unsigned long v;
	 struct SOFT_COMP_3_REG_T_
	 {
		 unsigned soft_comp_3_reg                               : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}SOFT_COMP_3_REG_U;

typedef union SOFT_COMP_UPDATE_REG_U_
{
	 unsigned long v;
	 struct SOFT_COMP_UPDATE_REG_T_
	 {
		 unsigned soft_comp_update_reg                          : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}SOFT_COMP_UPDATE_REG_U;


typedef union CLR_IR_STATS_IRQ_U_
{
	 unsigned long v;
	 struct CLR_IR_STATS_IRQ_T_
	 {
		 unsigned clr_ir_stats_irq                              : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}CLR_IR_STATS_IRQ_U;

typedef union IR_STATS_IRQ_ENA_U_
{
	 unsigned long v;
	 struct IR_STATS_IRQ_ENA_T_
	 {
		 unsigned ir_stats_irq_ena                              : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}IR_STATS_IRQ_ENA_U;

typedef union IRMINIMUMPIXELCOUNT_REG_U_
{
	 unsigned long v;
	 struct IRMINIMUMPIXELCOUNT_REG_T_
	 {
		 unsigned irminimumpixelcount_reg                       : 20;
		 unsigned reserved0                                     : 12;
	 }bit_info;
}IRMINIMUMPIXELCOUNT_REG_U;

typedef union COMP_0_U_
{
	 unsigned long v;
	 struct COMP_0_T_
	 {
		 unsigned comp_0                                        : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}COMP_0_U;

typedef union COMP_1_U_
{
	 unsigned long v;
	 struct COMP_1_T_
	 {
		 unsigned comp_1                                        : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}COMP_1_U;

typedef union COMP_2_U_
{
	 unsigned long v;
	 struct COMP_2_T_
	 {
		 unsigned comp_2                                        : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}COMP_2_U;

typedef union COMP_3_U_
{
	 unsigned long v;
	 struct COMP_3_T_
	 {
		 unsigned comp_3                                        : 12;
		 unsigned reserved0                                     : 20;
	 }bit_info;
}COMP_3_U;

typedef union EVEN_INTENSITY_0_U_
{
	 unsigned long v;
	 struct EVEN_INTENSITY_0_T_
	 {
		 unsigned even_intensity_0                              : 32;
	 }bit_info;
}EVEN_INTENSITY_0_U;

typedef union EVEN_INTENSITY_1_U_
{
	 unsigned long v;
	 struct EVEN_INTENSITY_1_T_
	 {
		 unsigned even_intensity_1                              : 32;
	 }bit_info;
}EVEN_INTENSITY_1_U;

typedef union EVEN_INTENSITY_2_U_
{
	 unsigned long v;
	 struct EVEN_INTENSITY_2_T_
	 {
		 unsigned even_intensity_2                              : 32;
	 }bit_info;
}EVEN_INTENSITY_2_U;

typedef union EVEN_INTENSITY_3_U_
{
	 unsigned long v;
	 struct EVEN_INTENSITY_3_T_
	 {
		 unsigned even_intensity_3                              : 32;
	 }bit_info;
}EVEN_INTENSITY_3_U;

typedef union EVEN_COUNT_0_U_
{
	 unsigned long v;
	 struct EVEN_COUNT_0_T_
	 {
		 unsigned even_count_0                                  : 32;
	 }bit_info;
}EVEN_COUNT_0_U;

typedef union EVEN_COUNT_1_U_
{
	 unsigned long v;
	 struct EVEN_COUNT_1_T_
	 {
		 unsigned even_count_1                                  : 32;
	 }bit_info;
}EVEN_COUNT_1_U;

typedef union EVEN_COUNT_2_U_
{
	 unsigned long v;
	 struct EVEN_COUNT_2_T_
	 {
		 unsigned even_count_2                                  : 32;
	 }bit_info;
}EVEN_COUNT_2_U;

typedef union EVEN_COUNT_3_U_
{
	 unsigned long v;
	 struct EVEN_COUNT_3_T_
	 {
		 unsigned even_count_3                                  : 32;
	 }bit_info;
}EVEN_COUNT_3_U;

typedef union ODD_INTENSITY_0_U_
{
	 unsigned long v;
	 struct ODD_INTENSITY_0_T_
	 {
		 unsigned odd_intensity_0                               : 32;
	 }bit_info;
}ODD_INTENSITY_0_U;

typedef union ODD_INTENSITY_1_U_
{
	 unsigned long v;
	 struct ODD_INTENSITY_1_T_
	 {
		 unsigned odd_intensity_1                               : 32;
	 }bit_info;
}ODD_INTENSITY_1_U;

typedef union ODD_INTENSITY_2_U_
{
	 unsigned long v;
	 struct ODD_INTENSITY_2_T_
	 {
		 unsigned odd_intensity_2                               : 32;
	 }bit_info;
}ODD_INTENSITY_2_U;

typedef union ODD_INTENSITY_3_U_
{
	 unsigned long v;
	 struct ODD_INTENSITY_3_T_
	 {
		 unsigned odd_intensity_3                               : 32;
	 }bit_info;
}ODD_INTENSITY_3_U;

typedef union ODD_COUNT_0_U_
{
	 unsigned long v;
	 struct ODD_COUNT_0_T_
	 {
		 unsigned odd_count_0                                   : 32;
	 }bit_info;
}ODD_COUNT_0_U;

typedef union ODD_COUNT_1_U_
{
	 unsigned long v;
	 struct ODD_COUNT_1_T_
	 {
		 unsigned odd_count_1                                   : 32;
	 }bit_info;
}ODD_COUNT_1_U;

typedef union ODD_COUNT_2_U_
{
	 unsigned long v;
	 struct ODD_COUNT_2_T_
	 {
		 unsigned odd_count_2                                   : 32;
	 }bit_info;
}ODD_COUNT_2_U;

typedef union ODD_COUNT_3_U_
{
	 unsigned long v;
	 struct ODD_COUNT_3_T_
	 {
		 unsigned odd_count_3                                   : 32;
	 }bit_info;
}ODD_COUNT_3_U;

typedef union ROW_CNT_U_
{
	 unsigned long v;
	 struct ROW_CNT_T_
	 {
		 unsigned row_cnt                                       : 16;
		 unsigned reserved0                                     : 16;
	 }bit_info;
}ROW_CNT_U;

typedef union COL_CNT_U_
{
	 unsigned long v;
	 struct COL_CNT_T_
	 {
		 unsigned col_cnt                                       : 16;
		 unsigned reserved0                                     : 16;
	 }bit_info;
}COL_CNT_U;

typedef union FRAME_ORDER_U_
{
	 unsigned long v;
	 struct FRAME_ORDER_T_
	 {
		 unsigned frame_order                                   : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}FRAME_ORDER_U;

typedef union DPU_DATA_SOURCE_U_
{
	 unsigned long v;
	 struct DPU_DATA_SOURCE_T_
	 {
		 unsigned dpu_data_source                               : 3;
		 unsigned reserved0                                     : 29;
	 }bit_info;
}DPU_DATA_SOURCE_U;

typedef union CAP_CLK_EDGE_U_
{
	 unsigned long v;
	 struct CAP_CLK_EDGE_T_
	 {
		 unsigned cap_clk_edge                                  : 3;
		 unsigned reserved0                                     : 29;
	 }bit_info;
}CAP_CLK_EDGE_U;

typedef union ADC_RSTN_U_
{
	 unsigned long v;
	 struct ADC_RSTN_T_
	 {
		 unsigned adc_rstn                                      : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}ADC_RSTN_U;

typedef union CORTEXA7_ADDR_MODIFY_U_
{
	 unsigned long v;
	 struct CORTEXA7_ADDR_MODIFY_T_
	 {
		 unsigned cortexA7_Addr_Modify                          : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}CORTEXA7_ADDR_MODIFY_U;

typedef union CORTEXA7_MODIFY_ADDR_U_
{
	 unsigned long v;
	 struct CORTEXA7_MODIFY_ADDR_T_
	 {
		 unsigned cortexa7_modify_addr                          : 32;
	 }bit_info;
}CORTEXA7_MODIFY_ADDR_U;

typedef union DSP_INT_TYPE_U_
{
	 unsigned long v;
	 struct DSP_INT_TYPE_T_
	 {
		 unsigned dsp_int_type                                  : 2;
		 unsigned reserved0                                     : 30;
	 }bit_info;
}DSP_INT_TYPE_U;

typedef union INT0_REQ_CNT_U_
{
	 unsigned long v;
	 struct INT0_REQ_CNT_T_
	 {
		 unsigned int0_req_cnt                                  : 32;
	 }bit_info;
}INT0_REQ_CNT_U;

typedef union NMI_REQ_CNT_U_
{
	 unsigned long v;
	 struct NMI_REQ_CNT_T_
	 {
		 unsigned nmi_req_cnt                                   : 32;
	 }bit_info;
}NMI_REQ_CNT_U;

typedef union INT0_ACK_CNT_U_
{
	 unsigned long v;
	 struct INT0_ACK_CNT_T_
	 {
		 unsigned int0_ack_cnt                                  : 32;
	 }bit_info;
}INT0_ACK_CNT_U;

typedef union NMI_ACK_CNT_U_
{
	 unsigned long v;
	 struct NMI_ACK_CNT_T_
	 {
		 unsigned nmi_ack_cnt                                   : 32;
	 }bit_info;
}NMI_ACK_CNT_U;

typedef union SELECT_REF_SRC_U_
{
	 unsigned long v;
	 struct SELECT_REF_SRC_T_
	 {
		 unsigned select_ref_src                                : 1;
		 unsigned reserved0                                     : 31;
	 }bit_info;
}SELECT_REF_SRC_U;

typedef union SYS_CON3_DUMMY_U_
{
	 unsigned long v;
	 struct SYS_CON3_DUMMY_T_
	 {
		 unsigned sys_con3_dummy                                : 32;
	 }bit_info;
}SYS_CON3_DUMMY_U;

typedef struct SYS_CON3_T_
{
   PAD_SHARE_0_U                                 pad_share_0                                  ; //0x0000
   PAD_SHARE_1_U                                 pad_share_1                                  ; //0x0004
   PAD_SHARE_2_U                                 pad_share_2                                  ; //0x0008
   PAD_SHARE_3_U                                 pad_share_3                                  ; //0x000c
   PAD_SHARE_4_U                                 pad_share_4                                  ; //0x0010
   PAD_SHARE_5_U                                 pad_share_5                                  ; //0x0014
   SYS_CON3_DUMMY_U                              sys_con3_dummy0                              ; //0x0018
   SYS_CON3_DUMMY_U                              sys_con3_dummy1                              ; //0x001c
   SYS_CON3_DUMMY_U                              sys_con3_dummy2                              ; //0x0020
   SYS_CON3_DUMMY_U                              sys_con3_dummy3                              ; //0x0024
   SYS_CON3_DUMMY_U                              sys_con3_dummy4                              ; //0x0028
   SYS_CON3_DUMMY_U                              sys_con3_dummy5                              ; //0x002c
   SYS_CON3_DUMMY_U                              sys_con3_dummy6                              ; //0x0030
   SYS_CON3_DUMMY_U                              sys_con3_dummy7                              ; //0x0034
   SYS_CON3_DUMMY_U                              sys_con3_dummy8                              ; //0x0038
   SYS_CON3_DUMMY_U                              sys_con3_dummy9                              ; //0x003c
   SYS_CON3_DUMMY_U                              sys_con3_dummy10                             ; //0x0040
   SYS_CON3_DUMMY_U                              sys_con3_dummy11                             ; //0x0044
   SYS_CON3_DUMMY_U                              sys_con3_dummy12                             ; //0x0048
   SYS_CON3_DUMMY_U                              sys_con3_dummy13                             ; //0x004c
   SYS_CON3_DUMMY_U                              sys_con3_dummy14                             ; //0x0050
   SYS_CON3_DUMMY_U                              sys_con3_dummy15                             ; //0x0054
   SYS_CON3_DUMMY_U                              sys_con3_dummy16                             ; //0x0058
   SYS_CON3_DUMMY_U                              sys_con3_dummy17                             ; //0x005c
   SYS_CON3_DUMMY_U                              sys_con3_dummy18                             ; //0x0060
   SYS_CON3_DUMMY_U                              sys_con3_dummy19                             ; //0x0064
   SYS_CON3_DUMMY_U                              sys_con3_dummy20                             ; //0x0068
   SYS_CON3_DUMMY_U                              sys_con3_dummy21                             ; //0x006c
   SYS_CON3_DUMMY_U                              sys_con3_dummy22                             ; //0x0070
   SYS_CON3_DUMMY_U                              sys_con3_dummy23                             ; //0x0074
   SYS_CON3_DUMMY_U                              sys_con3_dummy24                             ; //0x0078
   SYS_CON3_DUMMY_U                              sys_con3_dummy25                             ; //0x007c
   I2C_OUTPUT_CTL_U                              i2c_output_ctl                               ; //0x0080
   SEL_EXT_USB2_CTRL_U                           sel_ext_usb2_ctrl                            ; //0x0084
   SEL_USB2_UTMI_CLK_U                           sel_usb2_utmi_clk                            ; //0x0088
   IMG_WIDTH_REG_U                               img_width_reg                                ; //0x008c
   IMG_HEIGHT_REG_U                              img_height_reg                               ; //0x0090
   IRSTATTHRESHOLD_REG_U                         IRStatThreshold_reg                          ; //0x0094
   BYPASS_IR_STATS_U                             bypass_ir_stats                              ; //0x0098
   FROZEN_HW_UPDATE_COM_U                        frozen_hw_update_com                         ; //0x009c
   IR_STATS_ENABLE_U                             ir_stats_enable                              ; //0x00a0
   ENA_CLR_ODD_COUNT_U                           ena_clr_odd_count                            ; //0x00a4
   ENA_CLR_EVEN_COUNT_U                          ena_clr_even_count                           ; //0x00a8
   FORCE_COMP_PIX_U                              force_comp_pix                               ; //0x00ac
   SOFT_COMP_0_REG_U                             soft_comp_0_reg                              ; //0x00b0
   SOFT_COMP_1_REG_U                             soft_comp_1_reg                              ; //0x00b4
   SOFT_COMP_2_REG_U                             soft_comp_2_reg                              ; //0x00b8
   SOFT_COMP_3_REG_U                             soft_comp_3_reg                              ; //0x00bc
   SOFT_COMP_UPDATE_REG_U                        soft_comp_update_reg                         ; //0x00c0
   CLR_IR_STATS_IRQ_U                            clr_ir_stats_irq                             ; //0x00c4
   IR_STATS_IRQ_ENA_U                            ir_stats_irq_ena                             ; //0x00c8
   IRMINIMUMPIXELCOUNT_REG_U                     IRMinimumPixelCount_reg                      ; //0x00cc
   COMP_0_U                                      comp_0                                       ; //0x00d0
   COMP_1_U                                      comp_1                                       ; //0x00d4
   COMP_2_U                                      comp_2                                       ; //0x00d8
   COMP_3_U                                      comp_3                                       ; //0x00dc
   EVEN_INTENSITY_0_U                            even_intensity_0                             ; //0x00e0
   EVEN_INTENSITY_1_U                            even_intensity_1                             ; //0x00e4
   EVEN_INTENSITY_2_U                            even_intensity_2                             ; //0x00e8
   EVEN_INTENSITY_3_U                            even_intensity_3                             ; //0x00ec
   EVEN_COUNT_0_U                                even_count_0                                 ; //0x00f0
   EVEN_COUNT_1_U                                even_count_1                                 ; //0x00f4
   EVEN_COUNT_2_U                                even_count_2                                 ; //0x00f8
   EVEN_COUNT_3_U                                even_count_3                                 ; //0x00fc
   ODD_INTENSITY_0_U                             odd_intensity_0                              ; //0x0100
   ODD_INTENSITY_1_U                             odd_intensity_1                              ; //0x0104
   ODD_INTENSITY_2_U                             odd_intensity_2                              ; //0x0108
   ODD_INTENSITY_3_U                             odd_intensity_3                              ; //0x010c
   ODD_COUNT_0_U                                 odd_count_0                                  ; //0x0110
   ODD_COUNT_1_U                                 odd_count_1                                  ; //0x0114
   ODD_COUNT_2_U                                 odd_count_2                                  ; //0x0118
   ODD_COUNT_3_U                                 odd_count_3                                  ; //0x011c
   ROW_CNT_U                                     row_cnt                                      ; //0x0120
   COL_CNT_U                                     col_cnt                                      ; //0x0124
   FRAME_ORDER_U                                 frame_order                                  ; //0x0128
   DPU_DATA_SOURCE_U                             dpu_data_source                              ; //0x012c
   CAP_CLK_EDGE_U                                cap_clk_edge                                 ; //0x0130
   ADC_RSTN_U                                    adc_rstn                                     ; //0x0134
   CORTEXA7_ADDR_MODIFY_U                        cortexA7_Addr_Modify                         ; //0x0138
   CORTEXA7_MODIFY_ADDR_U                        cortexA7_Modify_Addr                         ; //0x013c
   DSP_INT_TYPE_U                                dsp_int_type                                 ; //0x0140
   INT0_REQ_CNT_U                                int0_req_cnt                                 ; //0x0144
   NMI_REQ_CNT_U                                 nmi_req_cnt                                  ; //0x0148
   INT0_ACK_CNT_U                                int0_ack_cnt                                 ; //0x014c
   NMI_ACK_CNT_U                                 nmi_ack_cnt                                  ; //0x0150
   SELECT_REF_SRC_U                              select_ref_src                               ; //0x0154
}SYS_CON3_T;

#endif//__SYS_CON3_H__
